[
  {
    "url": "https://www.madewithnestle.ca/aero/aero-smores-bars",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "raw_data": [
      "Aero",
      "AERO S'Mores bars",
      "Share This",
      "Facebook",
      "Twitter",
      "Pinterest",
      "Email",
      "Yum",
      "Share",
      "AERO S'Mores bars",
      "42 g",
      "Enjoy the creamy, bubbly, melty experience of NESTLÉ AERO S'mores. Each piece of this decadent chocolate bar is enrobed in rich milk chocolate and filled with melt-in-your-mouth bubbles with graham cracker and marshmallow flavours. Each piece is easy to break off and share with family and friends. Proudly prepared in Canada, NESTLÉ AERO S'mores are made from quality ingredients like natural flavours. Feel the bubbles melt!",
      "Features and Benefits",
      "AERO S'Mores bars",
      "Features and Benefits",
      "Feel The Bubbles Melt: Indulge in NESTLÉ AERO S'mores, a decadent chocolate bar where each piece is enrobed in rich milk chocolate and filled with AERO's melt-in-your-mouth bubbles with graham cracker and marshmallow flavours",
      "Perfect For Sharing: Each piece is easy to break off and share with family and friends",
      "Proudly Prepared In Canada: NESTLÉ AERO S'mores are prepared in Canada",
      "Natural Flavours: NESTLÉ AERO S'mores are made with natural flavours",
      "Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities",
      "Proudly Supporting Kids Help Phone: For more than 32 years NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7 e-mental health service, available in English and French",
      "Nutrition Information",
      "AERO S'Mores bars",
      "Nutrition Information",
      "Per 1 bar (42 g)",
      "Amount",
      "% DV",
      "Calories",
      "230",
      "Carbohydrate",
      "26",
      "g",
      "Dietary Fibre",
      "0",
      "g",
      "0",
      "%",
      "Sugars",
      "25",
      "g",
      "25",
      "%",
      "Fat",
      "13",
      "g",
      "17",
      "%",
      "Cholesterol",
      "10",
      "mg",
      "Saturated",
      "7",
      "g",
      "Trans Fat",
      "0.1",
      "g",
      "Protein",
      "2",
      "g",
      "Sodium",
      "35",
      "mg",
      "2",
      "%",
      "Amount",
      "% DV",
      "Calcium",
      "75",
      "mg",
      "6",
      "%",
      "Iron",
      "0.5",
      "mg",
      "3",
      "%",
      "Potassium",
      "125",
      "mg",
      "4",
      "%",
      "Ingredients",
      "AERO S'Mores bars",
      "Ingredients",
      "Sugars (sugar, lactose), Modified milk ingredients, Cocoa butter‡ Unsweetened chocolate‡, Soy lecithin, Polyglycerol polyricinoleate, Natural flavour. ‡Rainforest Alliance Certified"
    ]
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-scoops-vanilla-bean",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "raw_data": [
      "Aero",
      "AERO Scoops Vanilla Bean",
      "Share This",
      "Facebook",
      "Twitter",
      "Pinterest",
      "Email",
      "Yum",
      "Share",
      "AERO Scoops Vanilla Bean",
      "105 g",
      "Indulge in NESTLÉ AERO SCOOPS Vanilla Bean, where smooth milk chocolate meets AERO's melt-in-your-mouth bubbles and a delicious vanilla bean ice cream-flavoured filling. Easy to break off pieces make sharing with family and friends effortless. Proudly prepared in Canada, NESTLÉ AERO SCOOPS Vanilla Bean are made with quality ingredients including, natural flavours. As part of a commitment to sustainability practices, NESTLÉ purchases sustainably sourced cocoa certified by the Rainforest Alliance. Besides creating delicious treats, NESTLÉ supports a worthy cause. For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service. Enjoy the rich combination of milk chocolate, bubbles, and vanilla bean ice cream-flavoured filling in NESTLÉ AERO SCOOPS Vanilla Bean, and feel the bubbles melt!",
      "Features and Benefits",
      "AERO Scoops Vanilla Bean",
      "Features and Benefits",
      "Feel The Bubbles Melt: Indulge in NESTLÉ AERO SCOOPS Vanilla Bean featuring milk chocolate, AERO's melt-in-your-mouth bubbles, and vanilla bean ice cream-flavoured filling",
      "Perfect For Sharing: Easy to break off pieces make this decadent treat perfect to share with family and friends",
      "Proudly Prepared In Canada: NESTLÉ AERO SCOOPS Vanilla Bean are prepared in Canada",
      "Quality Ingredients: NESTLÉ AERO SCOOPS Vanilla Bean are made with natural flavours",
      "Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases Rainforest Alliance-certified cocoa",
      "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
      "Nutrition Information",
      "AERO Scoops Vanilla Bean",
      "Nutrition Information",
      "Per 8 pieces (40g)",
      "Amount",
      "% DV",
      "Calories",
      "220",
      "Carbohydrate",
      "23",
      "g",
      "Dietary Fibre",
      "1",
      "g",
      "4",
      "%",
      "Sugars",
      "22",
      "g",
      "22",
      "%",
      "Fat",
      "14",
      "g",
      "19",
      "%",
      "Cholesterol",
      "10",
      "mg",
      "Saturated",
      "8",
      "g",
      "Trans Fat",
      "0.1",
      "g",
      "Protein",
      "2",
      "g",
      "Sodium",
      "30",
      "mg",
      "1",
      "%",
      "Amount",
      "% DV",
      "Calcium",
      "75",
      "mg",
      "6",
      "%",
      "Iron",
      "0.5",
      "mg",
      "3",
      "%",
      "Potassium",
      "125",
      "mg",
      "4",
      "%",
      "Ingredients",
      "AERO Scoops Vanilla Bean",
      "Ingredients",
      "Sugars (sugar, lactose), Modified milk ingredients, Cocoa butter‡, Unsweetened chocolate‡, Modified palm oil, Soy lecithin, Polyglycerol polyricinoleate, Natural flavour. ‡Rainforest Alliance Certified"
    ]
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-scoops-double-chocolate",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "raw_data": [
      "Aero",
      "AERO Scoops Double Chocolate",
      "Share This",
      "Facebook",
      "Twitter",
      "Pinterest",
      "Email",
      "Yum",
      "Share",
      "AERO Scoops Double Chocolate",
      "15x105 g",
      "Indulge in NESTLÉ AERO SCOOPS Double Chocolate, where smooth milk chocolate meets AERO's melt-in-your-mouth bubbles and a delicious chocolate ice cream-flavoured filling. Easy to break off pieces make sharing with family and friends effortless. Proudly prepared in Canada using 100% Canadian milk, NESTLÉ AERO SCOOPS Double Chocolate are made with quality ingredients, including natural flavours. Committed to sustainability, NESTLÉ uses sustainably sourced cocoa certified by the Rainforest Alliance. Besides creating delicious treats, NESTLÉ supports a worthy cause. For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service. Enjoy the rich combination of milk chocolate, bubbles, and chocolate ice cream-flavoured filling in NESTLÉ AERO SCOOPS Double Chocolate, and feel the bubbles melt!",
      "Features and Benefits",
      "AERO Scoops Double Chocolate",
      "Features and Benefits",
      "Feel The Bubbles Melt: Indulge in NESTLÉ AERO SCOOPS Double Chocolate featuring milk chocolate, AERO's melt-in-your-mouth bubbles, and chocolate ice cream-flavoured filling",
      "Perfect For Sharing: Easy to break off pieces make this decadent treat perfect to share with family and friends",
      "Proudly Prepared In Canada: Prepared with 100% Canadian milk",
      "Quality Ingredients: NESTLÉ AERO SCOOPS Double Chocolate are made with natural flavours",
      "Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases Rainforest Alliance-certified cocoa",
      "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
      "Nutrition Information",
      "AERO Scoops Double Chocolate",
      "Nutrition Information",
      "Per 8 pieces (40 g)",
      "Amount",
      "% DV",
      "Calories",
      "220",
      "Carbohydrate",
      "24",
      "g",
      "Dietary Fibre",
      "1",
      "g",
      "4",
      "%",
      "Sugars",
      "22",
      "g",
      "22",
      "%",
      "Fat",
      "13",
      "g",
      "17",
      "%",
      "Cholesterol",
      "10",
      "mg",
      "Saturated",
      "7",
      "g",
      "Trans Fat",
      "0.1",
      "g",
      "Protein",
      "2",
      "g",
      "Sodium",
      "30",
      "mg",
      "1",
      "%",
      "Amount",
      "% DV",
      "Calcium",
      "75",
      "mg",
      "6",
      "%",
      "Iron",
      "1",
      "mg",
      "6",
      "%",
      "Potassium",
      "175",
      "mg",
      "5",
      "%",
      "Ingredients",
      "AERO Scoops Double Chocolate",
      "Ingredients",
      "Sugars (sugar, lactose), Cocoa butter‡, Unsweetened chocolate‡, Skim milk powder, Milk fat, Whey powder, Modified palm oil, Natural flavour, Soy lecithin, Polyglycerol polyricinoleate. ‡ Rainforest Alliance Certified"
    ]
  }
]