[
  {
    "title": "Nescafé Iced Dalgona Coffee",
    "description": "Treat yourself with this delicious twist on iced coffee! Our dalgona coffee recipe is easily made in 3 quick steps, then you can sit back, relax and enjoy",
    "prep_time_mins": 0,
    "cook_time_mins": 5,
    "servings": 1,
    "skill_level": "Beginner",
    "ingredients": [
      "2 tsp Nescafé Iced Instant Coffee",
      "2 tsp White Sugar",
      "2 tsp Cold Water",
      "100 ml Milk",
      "Ice"
    ],
    "instructions": [
      "Treat yourself with this delicious twist on iced coffee! Our dalgona coffee recipe is easily made in 3 quick steps, then you can sit back, relax and enjoy",
      "In a glass, mix coffee, water and sugar with a hand frother",
      "Add ice to the top",
      "Top up with milk and joy"
    ],
    "url": "https://www.madewithnestle.ca/recipe/nescafe-iced-dalgona"
  },
  {
    "title": "Nescafé Iced Coconut Latte",
    "description": "A chilled tropical latte, sweetened with cane sugar",
    "prep_time_mins": 0,
    "cook_time_mins": 5,
    "servings": 1,
    "skill_level": "Beginner",
    "ingredients": [
      "2 tsp Nescafé Iced Instant Coffee",
      "1 tbsp Vanilla Syrup",
      "200 ml Coconut Milk",
      "Ice"
    ],
    "instructions": [
      "A chilled tropical latte, sweetened with cane sugar",
      "In a tall glass, mix the coconut milk, syrup and coffee",
      "Add ice to the top and enjoy"
    ],
    "url": "https://www.madewithnestle.ca/recipe/iced-coconut-latte-nescafe"
  },
  {
    "title": "Nescafé Espresso Martini",
    "description": "This deliciously creamy espresso martini is the perfect mocktail to bond over.",
    "prep_time_mins": 0,
    "cook_time_mins": 5,
    "servings": 1,
    "skill_level": "Intermediate",
    "ingredients": [
      "2 tsp Nescafé Gold Espresso Instant Coffee",
      "60 ml hot water (approx. 80ºC)",
      "60 ml honey",
      "1 tbsp vanilla syrup",
      "1 tbsp heavy cream",
      "sprinkle coffee beans and cocoa powder"
    ],
    "instructions": [
      "This deliciously creamy espresso martini is the perfect mocktail to bond over.",
      "When you see condensation on the shaker, you’ll know it’s ready.",
      "Add water, honey and vanilla syrup to a saucepan. Bring to a boil, simmer for 2 minutes, and cool.",
      "Mix 2 teaspoons of Nescafé® Gold Espresso and 60 ml hot water, heated to 80ºC.",
      "Gently pour in the syrup mixture, followed by the cream, and stir well.",
      "Pour the coffee mixture into your chilled shaker.",
      "Make sure your shaker is tightly sealed, and shake well for about 30 seconds.",
      "Pour the chilled & shaken coffee mixture into a martini glass.",
      "Sprinkle with cocoa power and garnish with coffee beans"
    ],
    "url": "https://www.madewithnestle.ca/recipe/nescafe-espresso-martini"
  },
  {
    "title": "Carnation Hot Chocolate Mocha Sphere",
    "description": "Unleash your inner chocolatier and have a blast preparing these indulgent treats. As you melt open the chocolate shell, be prepared to discover a hidden treasure of mini marshmallows, perfectly blended with the richness of Carnation Hot Chocolate and your favourite Nescafé. These mocha spheres offer a special moment to cozy up and treat yourself to a comforting and heavenly chocolatey experience.",
    "prep_time_mins": 5,
    "cook_time_mins": 10,
    "servings": 1,
    "skill_level": "Intermediate",
    "ingredients": [
      "2 cups of chocolate (70% cocoa or higher)",
      "1tsp Carnation Hot Chocolate",
      "1tsp Nescafé instant coffee",
      "Sprinkles",
      "100ml Milk",
      "Small Marshmallows"
    ],
    "instructions": [
      "Start by melting dark chocolate in a bowl over hot water. You can do this by placing the bowl over hot water on the stove, stirring until chocolate is completely melted.",
      "Once the chocolate has melted, carefully scoop a teaspoon at a time into the mold. Make sure to fill each cavity of the mold evenly.",
      "Place the mold in the fridge to allow the chocolate to set and harden. This should take approximately 5 minutes to cool off.",
      "After the chocolate has hardened, take the mold out of the fridge. Gently pop the chocolate out of the mold, being careful not to break it.",
      "Take one half of the chocolate sphere and fill it with mini marshmallows, 25g of Carnation Hot chocolate, and 1 teaspoon of your favourite Nescafé instant coffee.",
      "Heat up a frying pan and once hot, place an empty hemisphere on top with the dome side up. Once it begins to melt, remove and connect to the filled hemisphere. The melted chocolate will allow the two hemispheres to bind.",
      "Take the remainder of melted hot chocolate and with a small brush go over the lining where the hemispheres connect to make sure it's fully connected.",
      "Let your creativity shine! Decorate your chocolate sphere with drizzles of melted chocolate, sprinkles, or any other toppings you like.",
      "Prepare a warm glass of milk.",
      "Lastly, place the chocolate sphere into the warm glass of milk. Sit back and watch as the sphere slowly melts, releasing its delicious contents into the milk. Stir gently to combine the flavours, and then enjoy your delightful and decadent mocha drink!",
      "If you want to temper your chocolate which would give it the hard, glossy look and brittle snap when broken: Melt 2/3 of your dark chocolate to a temperature of 46-48 degrees Celsius then remove from the heat and add the last 1/3 of the dark chocolate, while rapidly stirring and cooling it down to 28-30 Celsius.",
      "Depending on the size of the mold you have, you can adjust the recipe to more or less of the ingredients.",
      "To speed up the melting process once served, you can use a spoon or a hand frother."
    ],
    "url": "https://www.madewithnestle.ca/recipe/carnation-hot-chocolate-mocha-sphere"
  },
  {
    "title": "Mexican Hot Chocolate",
    "description": "Our Mexican Hot Chocolate recipe combines the smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip.",
    "prep_time_mins": 5,
    "cook_time_mins": 0,
    "servings": 1,
    "skill_level": "Easy",
    "ingredients": [
      "5tsp Carnation Hot Chocolate",
      "1 pinch teaspoon cinnamon",
      "1 pinch Cayenne Pepper",
      "Cinnamon Stick",
      "100ml hot water"
    ],
    "instructions": [
      "Our Mexican Hot Chocolate recipe combines the smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip.",
      "Start by pouring 100ml of hot water into a vessel big enough for frothing. Make sure the water is hot to properly dissolve the ingredients.",
      "Add the Carnation Hot Chocolate to the hot water.",
      "Then, sprinkle in the cinnamon and cayenne pepper. These spices will add a delightful twist to your hot chocolate.",
      "Use a hand frother to froth the beverage. This will create a creamy and frothy texture, enhancing the overall experience.",
      "Pour the frothed hot chocolate into your serving mug. Make sure to leave some space at the top for the toppings.",
      "Sprinkle a bit of cinnamon on top of the hot chocolate. This will add a lovely aroma and an extra hint of cinnamon flavour.",
      "To garnish, add a cinnamon stick to your mug. It not only looks visually appealing but also adds a touch of elegance to your hot chocolate.",
      "Cozy up with your delicious mug of spiced hot chocolate and take a moment to unwind and enjoy.",
      "If you don't have a hand frother you can use a shaker or jar."
    ],
    "url": "https://www.madewithnestle.ca/recipe/mexican-hot-chocolate"
  }
]