[
  {
    "url": "https://www.madewithnestle.ca/aero/aero-smores-bars",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO S'Mores bars",
    "weight": "42 g",
    "description": "Aero AERO S'Mores bars Share This Facebook Twitter Pinterest Email Yum Share AERO S'Mores bars 42 g",
    "features_benefits": "Feel The Bubbles Melt: Indulge in NESTLÉ AERO S'mores, a decadent chocolate bar where each piece is enrobed in rich milk chocolate and filled with AERO's melt-in-your-mouth bubbles with graham cracker and marshmallow flavours Perfect For Sharing: Each piece is easy to break off and share with family and friends Proudly Prepared In Canada: NESTLÉ AERO S'mores are prepared in Canada Natural Flavours: NESTLÉ AERO S'mores are made with natural flavours Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities Proudly Supporting Kids Help Phone: For more than 32 years NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7 e-mental health service, available in English and French",
    "nutrition": "Per 1 bar (42 g) Amount % DV Calories 230 Carbohydrate 26 g Dietary Fibre 0 g 0 % Sugars 25 g 25 % Fat 13 g 17 % Cholesterol 10 mg Saturated 7 g Trans Fat 0.1 g Protein 2 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 0.5 mg 3 % Potassium 125 mg 4 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-scoops-vanilla-bean",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Scoops Vanilla Bean",
    "weight": "105 g",
    "description": "Aero AERO Scoops Vanilla Bean Share This Facebook Twitter Pinterest Email Yum Share AERO Scoops Vanilla Bean 105 g",
    "features_benefits": "Feel The Bubbles Melt: Indulge in NESTLÉ AERO SCOOPS Vanilla Bean featuring milk chocolate, AERO's melt-in-your-mouth bubbles, and vanilla bean ice cream-flavoured filling Perfect For Sharing: Easy to break off pieces make this decadent treat perfect to share with family and friends Proudly Prepared In Canada: NESTLÉ AERO SCOOPS Vanilla Bean are prepared in Canada",
    "nutrition": "Per 8 pieces (40g) Amount % DV Calories 220 Carbohydrate 23 g Dietary Fibre 1 g 4 % Sugars 22 g 22 % Fat 14 g 19 % Cholesterol 10 mg Saturated 8 g Trans Fat 0.1 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 75 mg 6 % Iron 0.5 mg 3 % Potassium 125 mg 4 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-scoops-double-chocolate",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Scoops Double Chocolate",
    "weight": "Per 8 pieces (40 g)",
    "description": "Aero AERO Scoops Double Chocolate Share This Facebook Twitter Pinterest Email Yum Share AERO Scoops Double Chocolate 15x105 g",
    "features_benefits": "Feel The Bubbles Melt: Indulge in NESTLÉ AERO SCOOPS Double Chocolate featuring milk chocolate, AERO's melt-in-your-mouth bubbles, and chocolate ice cream-flavoured filling Perfect For Sharing: Easy to break off pieces make this decadent treat perfect to share with family and friends Proudly Prepared In Canada: Prepared with 100% Canadian milk",
    "nutrition": "Per 8 pieces (40 g) Amount % DV Calories 220 Carbohydrate 24 g Dietary Fibre 1 g 4 % Sugars 22 g 22 % Fat 13 g 17 % Cholesterol 10 mg Saturated 7 g Trans Fat 0.1 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 175 mg 5 %",
    "ingredients": "Sugars (sugar, lactose), Cocoa butter‡, Unsweetened chocolate‡, Skim milk powder, Milk fat, Whey powder, Modified palm oil, Natural flavour, Soy lecithin, Polyglycerol polyricinoleate. ‡ Rainforest Alliance Certified"
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-scoops-choco-strawberry",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Scoops Choco Strawberry",
    "weight": "15 x 105 g",
    "description": "Aero AERO Scoops Choco Strawberry Share This Facebook Twitter Pinterest Email Yum Share AERO Scoops Choco Strawberry 15 x 105 g",
    "features_benefits": "Feel The Bubbles Melt: Indulge in NESTLÉ AERO Scoops Choco Strawberry featuring milk chocolate, AERO's melt-in-your-mouth bubbles, and strawberry ice cream-flavoured filling Perfect For Sharing: Easy to break off pieces make this decadent treat perfect to share with family and friends Proudly Prepared In Canada: Prepared with 100% Canadian milk",
    "nutrition": "Per 8 pieces (40 g) Amount % DV Calories 220 Carbohydrate 23 g Fibre 1 g 4 % Sugars 22 g 22 % Carbohydrate 23 g Fat 13 g 17 % Cholesterol 10 mg Saturated 8 g 41 % Trans 0.1 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 150 mg 4 %",
    "ingredients": "Sugars (sugar, lactose), Cocoa butter, Unsweetened chocolate, Skim milk powder, Milk fat, Whey powder, Beet red, Modified palm oil, Natural flavour, Soy lecithin, Polyglycerol polyricinoleate. Rainforest Alliance Certified"
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-truffle-salted-caramel",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "Aero Truffle Salted Caramel",
    "weight": "105 g",
    "description": "Aero Aero Truffle Salted Caramel Share This Facebook Twitter Pinterest Email Yum Share Aero Truffle Salted Caramel 105 g",
    "features_benefits": "Feel The Bubbles Melt: Indulge in NESTLÉ AERO Truffle Salted Caramel, a decadent chocolate bar where each piece is enrobed in rich milk chocolate and filled with AERO's melt-in-your-mouth bubbles and salted caramel-flavoured truffle filling Perfect For Sharing: Each piece is easy to break off and share with family and friends Natural Flavours: AERO Truffle Salted Caramel is made with natural flavours Prepared In Canada: Proudly prepared in Canada Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases Rainforest Alliance-certified cocoa Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "nutrition": "Per 8 segments (40 g) Amount % DV Calories 220 Carbohydrate 24 g Dietary Fiber 1 g 4 % Sugars 22 g 22 % Fat 13 g 17 % Cholesterol 10 mg Saturated 7 g Trans Fat 0.1 g Protein 2 g Sodium 45 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 175 mg 5 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/nestle-aero-truffle-brownie-105-g-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "NESTLÉ AERO TRUFFLE Brownie 105 g Bar",
    "weight": "NESTLÉ AERO TRUFFLE Brownie 105 g Bar",
    "description": "Aero NESTLÉ AERO TRUFFLE Brownie 105 g Bar Share This Facebook Twitter Pinterest Email Yum Share NESTLÉ AERO TRUFFLE Brownie 105 g Bar 105 g If AERO milk chocolate wasn't decadent enough for you, NESTLÉ AERO TRUFFLE Brownie Bar (105 g) is here to let you indulge in pure chocolatey bliss. Every delicious piece has a dark chocolate shell, with a bubbly milk chocolate truffle and fudge brownie flavoured filling you won't be able to resist. It's so smooth, so delightfully melt-in-your-mouth, that you'll want to break off a piece and share the experience with family and friends. After all, good things are made great when shared with others. It's sure to be your latest craving as you FEEL THE BUBBLES MELT. AERO TRUFFLE is also available in Black Forest Cake, Nanaimo Bar, Chocolate Mousse, and Tiramisu.",
    "features_benefits": "NESTLÉ AERO TRUFFLE Brownie Bar has a dark chocolate shell, with milk chocolate truffle and fudge brownie flavoured filling Smooth and irresistible, it's the latest way to FEEL THE BUBBLES MELT Each piece is easy to break off so you can share the decadent chocolate experience with family and friends Proudly prepared in Canada, and made with natural flavours and no artificial colours As part of the NESTLÉ COCOA PLAN, we purchase CERTIFIED cocoa from the RAINFOREST ALLIANCE and their farmers to help improve the quality of products and strengthen their communities",
    "nutrition": "Per 8 Segments (40g) Amount % DV Calories 230 Carbohydrate 21 g Dietary Fiber 2 g 7 % Sugars 16 g Fat 15 g 20 % Cholesterol 5 mg Saturated Fat 9 g Trans Fat 0.1 g Protein 2 g Sodium 15 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 2 mg 11 % Potassium 200 mg 4 %",
    "ingredients": "*Rainforest Alliance certified."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-pep-8ct-jrs-24-8x73-g",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Pep 8ct Jrs 24 8x7.3 g",
    "weight": "AERO Pep 8ct Jrs 24 8x7.3 g",
    "description": "Aero AERO Pep 8ct Jrs 24 8x7.3 g Share This Facebook Twitter Pinterest Email Yum Share AERO Pep 8ct Jrs 24 8x7.3 g 8 x 7.3 g",
    "features_benefits": "Feel The Bubbles Melt: Indulge in the smooth, creamy taste of milk chocolate, peppermint-flavoured centre, and melt-in-your-mouth bubbles with NESTLÉ AERO Peppermint snack size chocolate bars Easy To Share: Each snack size NESTLÉ AERO bar is individually wrapped making them ideal for everyday snacking or sharing with family and friends",
    "nutrition": "Pep 8 bars (58 g) Amount % DV Calories 310 Carbohydrate 36 g Fibre 1 g 4 % Sugars 35 g 35 % Cholesterol 15 mg Saturated Fat 10 g Total Fat 17 g 23 % Trans Fat 0.1 g Protein 3 g Sodium 50 mg 2 % Amount % DV Calcium 100 mg 8 % Iron 0.75 mg 4 % Potassium 200 mg 6 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-hide-me-eggs-100g",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Hide Me Eggs 100g",
    "weight": "AERO Hide Me Eggs 100g",
    "description": "Aero AERO Hide Me Eggs 100g Share This Facebook Twitter Pinterest Email Yum Share AERO Hide Me Eggs 100g 100 g Get ready to hide and seek your favourite milk chocolatey eggs with the lightness of AERO bubbles. NESTLÉ AERO Chocolatey Easter Hide Me Eggs (100 g) are miniature individually-wrapped, smooth milk chocolatey eggs with the creamy indulgence and lightness of bubbles you know and love. This package makes for a convenient way to start an Easter egg hunt, create a gift basket, or share with friends and family. FEEL THE BUBBLES MELT.",
    "features_benefits": "Miniature, individually-wrapped milk chocolatey eggs with the lightness of AERO bubbles Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service FEEL THE BUBBLES MELT",
    "nutrition": "Per 13 pieces (39 g) Amount % DV Calories 210 Carbohydrate 24 g Fibre 1 g 4 % Sugars 22 g 22 % Fat 12 g 16 % Cholesterol 10 mg Saturated 7 g Trans 0.1 g Protein 3 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 175 mg 5 % 5% or less is a little , 15% or more is a lot .",
    "ingredients": "Polydextrose 0.04g."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-valentines-minis-30-pack-219-g",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Valentine's Minis 30-pack, 219 g",
    "weight": "AERO Valentine's Minis 30-pack, 219 g",
    "description": "Aero AERO Valentine's Minis 30-pack, 219 g Share This Facebook Twitter Pinterest Email Yum Share AERO Valentine's Minis 30-pack, 219 g 219 g Love is in the AERO! This Valentine's Day, give a sweet little treat. AERO Valentine's Milk Chocolates 30-pack Carton (219 g) makes for the perfect Valentine's gift for the people you care about – it's filled with bite-sized versions of our classic, bubbly milk chocolates in a box that doubles as a Valentine's card that you can personalize with a special message for that special someone. A delight for whoever receives it, filled with more than enough to share with a group. Plus, it's prepared in Canada with all-natural flavours and it's peanut free, for even more reasons to enjoy this light, airy, chocolatey treat. FEEL THE BUBBLES MELT this Valentine's Day!",
    "features_benefits": "Our classic bubbly AERO milk chocolate, in a bite sized bar Peanut-free milk chocolate AERO Juniors with Valentine’s wrappers​ Our cocoa is sustainably sourced and certified, as part of the NESTLÉ COCOA PLAN​ Locally-made featuring our Prepared in Canada seal on front of pack​​ Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service Classic bubbly AERO milk chocolate, in a bite sized bar Each wrapper contains space for a personalized message",
    "nutrition": "Per 6 Bars (44g) Amount % DV Calories 230 Carbohydrate 28 g Dietary Fiber 1 g 4 % Sugars 26 g 26 % Fat 12 g 16 % Cholesterol 10 mg Saturated Fat 7 g Trans Fat 0.1 g Protein 3 g Sodium 40 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 200 mg 4 %",
    "ingredients": "Wheat."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-easter-chocolate-lamb-5-pack",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Easter Chocolate Lamb 5-pack",
    "weight": "125 g",
    "description": "Aero AERO Easter Chocolate Lamb 5-pack Share This Facebook Twitter Pinterest Email Yum Share AERO Easter Chocolate Lamb 5-pack 125 g Enjoy the classic taste of AERO – smooth, creamy milk chocolate with airy bubbles, shaped into adorable lambs",
    "features_benefits": "Now offering more value with a 5-pack versus 3-packs, in-line with competitive range​ 5 individually wrapped lambs perfect for making Easter baskets or as a treat​ All-natural flavours Proudly Prepared in Canada Our cocoa is sustainably sourced and certified, as part of the NESTLÉ COCOA PLAN",
    "nutrition": "Per 1 Lamb (25g) Amount % DV Calories 130 Carbohydrate 16 g Dietary Fiber 1 g 4 % Sugar 15 g Cholesterol 5 mg Saturated Fat 4 g Total Fat 7 g 9 % Protein 2 g Sodium 20 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 0.5 mg 3 % Potassium 100 mg 2 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/nestle-aero-novelty-bunny-94g",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "NESTLÉ AERO Novelty Bunny 94g",
    "weight": "NESTLÉ AERO Novelty Bunny 94g",
    "description": "Aero NESTLÉ AERO Novelty Bunny 94g Share This Facebook Twitter Pinterest Email Yum Share NESTLÉ AERO Novelty Bunny 94g 94 g NESTLÉ AERO Milk Chocolatey Easter Bunny (100 g) is a foil-wrapped, hollow, chocolatey bunny filled with classic AERO bubbly pieces. Each bite is chocolatey smooth, creamy indulgence with the lightness of bubbles you know and love.",
    "features_benefits": "Chocolate-filled treat Ideal price point, size and packaging for gifting occasions during the season It's a delightful gift to place in an Easter basket, to hide during egg hunts, or perfect just as a gift itself! Made with all-natural flavours",
    "nutrition": "Per 1/2 kit (47 g) Amount % DV Calories 260 Carbohydrate 26 g Fibre 2 g 7 % Sugars 24 g 24 % Fat 16 g 21 % Cholesterol 5 mg Saturated Fat 10 g Trans Fat 0.1 g Protein 3 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1.75 mg 10 % Potassium 200 mg 4 %",
    "ingredients": "Polydextrose 0.008 g per 47 g serving *Rainforest Alliance Certified"
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-halloween-25ct-carton",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Halloween 25ct Carton",
    "weight": "182 g",
    "description": "Aero AERO Halloween 25ct Carton Share This Facebook Twitter Pinterest Email Yum Share AERO Halloween 25ct Carton 182 g FEEL THE BUBBLES MELT with this 25-pack of NESTLÉ AERO mini bars (182 g). Each chocolate is smooth and creamy, with the lightness of the classic bubbles you know and love. NESTLÉ AERO mini bars are prepared in Toronto, Canada in a peanut-free facility and made with only natural flavours and sustainably sourced cocoa. Trick-or-treating at Halloween, road trips, beach days – no matter the occasion – these chocolates are sure to delight. This pack of 25 mini bars is perfectly portioned and individually wrapped for you to enjoy with friends and family.",
    "features_benefits": "Miniature, individually wrapped versions of your favourite NESTLÉ AERO mini bars, each chocolate is smooth and creamy, with the lightness of the classic bubbles you know and love Individually wrapped mini bars, perfect for trick-or-treating at Halloween or sharing with friends and family Proudly Prepared in Canada Our cocoa is sustainably sourced and certified, as part of the NESTLÉ COCOA PLAN. By working with the Rainforest Alliance, Nestlé supports cocoa farmers and the quality of their products. Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "nutrition": "Per 6 Bars (44g) Amount % DV Calories 230 0 % Dietary Fiber 1 g 4 % Sugars 26 g 26 % Total Carbohydrate 28 g Cholesterol 10 mg Saturated Fat 7 g 36 % Total Fat 12 g 16 % Protein 3 g 0 % Sodium 40 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 200 mg 4 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/smarties/easter-chocolate-assorted-hide-me-eggs-pouch",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "Easter Chocolate Assorted Hide Me Eggs Pouch",
    "weight": "500 g",
    "description": "Smarties Easter Chocolate Assorted Hide Me Eggs Pouch Share This Facebook Twitter Pinterest Email Yum Share Easter Chocolate Assorted Hide Me Eggs Pouch 500 g Just in time for Easter comes NESTLÉ Assorted Hide Me Eggs! These miniature, egg-shaped versions of classic NESTLÉ treats are individually wrapped in foil and ready to be hidden for an egg hunt, slipped into an Easter basket, or shared with family and friends. All your favourites are here - KITKAT milk chocolate eggs filled with crispy wafer pieces, SMARTIES milk chocolate eggs with miniature pieces of SMARTIES, COFFEE CRISP milk chocolate eggs with delicious COFFEE CRISP flavour and crispy wafers, and AERO milk chocolatey eggs filled with AERO's classic bubbles. NESTLÉ Assorted Hide Me Eggs are made with natural flavours, no artificial colours, and sustainably sourced cocoa that is certified by the Rainforest Alliance, an organization that works to help farmers improve the quality of their products and strengthen their communities.",
    "features_benefits": "Assortment of miniature milk chocolate eggs of your favourite NESTLÉ treats: SMARTIES, KITKAT, COFFEE CRISP, and AERO Natural flavours and colours Perfect for Easter egg hunts, gift baskets, or sharing chocolate treats with family and friends Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "nutrition": "SMARTIES eggs Per 4 eggs (36 g) Amount % DV Calories 190 Carbohydrate 22 g Fibre 0 g 0 % Sugars 21 g 21 % Fat 11 g 15 % Cholesterol 10 mg Saturated Fat 6 g Trans Fat 0.2 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 50 mg 4 % Iron 0.75 mg 4 % Potassium 125 mg 4 % *5% or less is a little, 15% or more is a lot Coffee Crisp eggs Per 6 eggs (42 g) Amount % DV Calories 220 Carbohydrate 26 g Fibre 1 g 4 % Sugars 24 g 24 % Fat 12 g 16 % Cholesterol 5 mg Saturated Fat 7 g Trans Fat 0.1 g Protein 3 g Sodium 25 mg 1 % Amount % DV Calcium 50 mg 4 % Iron 2 mg 11 % Potassium 150 mg 4 % *5% or less is a little, 15% or more is a lot aero eggs NFT Per 13 eggs (39 g) Amount % DV Calories 210 Carbohydrate 24 g Dietary Fiber 1 g 4 % Sugars 22 g 22 % Fat 12 g 16 % Cholesterol 10 mg Saturated 7 g Trans Fat 0.1 g Protein 3 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 175 mg 5 % KITKAT eggs NFT Per 4 eggs (36g) Amount % DV Calories 190 Carbohydrate 21 g Dietary Fibre 1 g 4 % Sugars 19 g 19 % Fat 11 g 15 % Cholesterol 5 mg Saturated 6 g Trans Fat 0.1 g Protein 2 g Sodium 25 mg 1 % Amount % DV Calcium 50 mg 4 % Iron 1.5 mg 8 % Potassium 125 mg 4 %",
    "ingredients": "May contain tree nuts and egg."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-truffle-tiramisu-milk-chocolate-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Tiramisu Milk Chocolate Bar",
    "weight": "105 g",
    "description": "Aero AERO Tiramisu Milk Chocolate Bar Share This Facebook Twitter Pinterest Email Yum Share AERO Tiramisu Milk Chocolate Bar 105 g As if AERO milk chocolate wasn't decadent enough, NESTLÉ AERO TRUFFLE Tiramisu Milk Chocolate Bar (105 g) introduces a new way to experience pure chocolate bliss. Each delicious piece of caramelized white chocolate, coated in a milk chocolate shell, is filled with a bubbly, coffee flavoured truffle centre you can't resist. It's so smooth, so delightfully melt-in-your-mouth, you'll want to break off a piece to share with family and friends. After all, good things are made great when experienced with others. It's sure to be your latest craving as you FEEL THE BUBBLES MELT. AERO TRUFFLE is also available in Black Forest Cake and Chocolate Mousse.",
    "features_benefits": "NESTLÉ AERO TRUFFLE Tiramisu Milk Chocolate Bar (105 g) is caramelized white chocolate, coated in a milk chocolate shell, with a bubbly, coffee flavoured truffle centre Smooth and irresistible, it's the latest way to FEEL THE BUBBLES MELT Each piece is easy to break off, and share the decadent chocolate experience with family and friends Proudly prepared in Canada, and made with natural flavours and no artificial colours Made with RAINFOREST ALLIANCE CERTIFIED Cocoa, as part of the NESTLÉ COCOA PLAN. We work with the RAINFOREST ALLIANCE and farmers to improve the quality of their products, and strengthen their communities",
    "nutrition": "Per 8 segments (40 g) Amount % DV Calories 220 Carbohydrate 23 g Fibre 1 g 4 % Sugars 22 g 22 % Fat 13 g 17 % Cholesterol 10 mg Saturated Fat 8 g 51 % Trans Fat 0.1 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 75 mg 6 % Iron 0.5 g 3 % Potassium 125 mg 3 %",
    "ingredients": "*Rainforest alliance certified™."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-truffle-chocolate-mousse-milk-chocolate-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO TRUFFLE Chocolate Mousse Milk Chocolate Bar",
    "weight": "105 g",
    "description": "Aero AERO TRUFFLE Chocolate Mousse Milk Chocolate Bar Share This Facebook Twitter Pinterest Email Yum Share AERO TRUFFLE Chocolate Mousse Milk Chocolate Bar 105 g As if AERO milk chocolate wasn't decadent enough, NESTLÉ AERO TRUFFLE Chocolate Mousse Milk Chocolate Bar (105 g) introduces a new way to experience pure chocolate bliss. Each delicious chocolate bar piece is rich in milk chocolate with a bubbly milk chocolate truffle centre you can't resist. It's so smooth, so delightfully melt-in-your-mouth, you'll want to break off a piece to share with family and friends. After all, good things are made great when experienced with others. It's sure to be your latest craving as you FEEL THE BUBBLES MELT.",
    "features_benefits": "NESTLÉ AERO TRUFFLE Chocolate Mousse Milk Chocolate Bar (105 g) is milk chocolate with a bubbly, rich, milk chocolate truffle centre Smooth and irresistible, it's the latest way to FEEL THE BUBBLES MELT Each piece is easy to break off, and share the decadent chocolate experience with family and friends Proudly prepared in Canada, and made with natural flavours and no artificial colours Made with RAINFOREST ALLIANCE CERTIFIED Cocoa, as part of the NESTLÉ COCOA PLAN. We work with the RAINFOREST ALLIANCE and farmers to improve the quality of their products, and strengthen their communities",
    "nutrition": "Per 8 segments (40 g) Amount % DV Calories 220 Carbohydrate 23 g 0 % Fibre 1 g 4 % Sugars 22 g 22 % Fat 13 g 17 % Cholesterol 10 mg Saturated Fat 8 g 31 % Trans Fat 0.1 g Protein 2 g Sodium 35 mg 2 % Amount % DV Calcium 50 mg 4 % Iron 0.1 mg 1 % Potassium 125 mg 3 %",
    "ingredients": "*Rainforest alliance certified™."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-milk-chocolate-minis-98g",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Milk Chocolate Minis 98g",
    "weight": "AERO Milk Chocolate Minis 98g",
    "description": "Aero AERO Milk Chocolate Minis 98g Share This Facebook Twitter Pinterest Email Yum Share AERO Milk Chocolate Minis 98g 98 g Take a moment to FEEL THE BUBBLES MELT, anywhere and anytime. This pouch full of NESTLÉ AERO Milk Chocolate Minis (98 g) is a convenient way to share the delight of smooth milk chocolate filled with airy bubbles. Proudly prepared in Canada, each piece is carefully made with natural flavours, and no artificial colours. Plus, we use only sustainably sourced cocoa, to ensure the best quality, and strengthen the communities of our farmers. It's simply the best way to FEEL THE BUBBLES MELT with family and friends.",
    "features_benefits": "Melt-in-your-mouth bites of real milk chocolate filled with tiny bubbles NESTLÉ AERO Milk Chocolate Minis (98 g) is proudly prepared in Canada and made with only natural flavours and no artificial colours Individual bubble-bites makes it easy to share with family and friends We purchase RAINFOREST ALLIANCE CERTIFIED cocoa, as part of the NESTLÉ COCOA PLAN. We work with the RAINFOREST ALLIANCE and farmers to improve the quality of their products and strengthen their communities FEEL THE BUBBLES MELT Proudly Prepared in Canada",
    "nutrition": "Per 11 Pieces (39g) Amount % DV Calories 210 Carbohydrate 24 g Dietary Fiber 1 g 4 % Cholesterol 10 mg Saturated Fat 7 g Total Fat 11 g 15 % Trans Fat 0.1 g Protein 2 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 0.1 mg 1 % Potassium 125 mg 3 %",
    "ingredients": "Wheat."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-milk-chocolate-minis-pouch-800-g",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Milk Chocolate Minis Pouch (800 g)",
    "weight": "AERO Milk Chocolate Minis Pouch (800 g)",
    "description": "Aero AERO Milk Chocolate Minis Pouch (800 g) Share This Facebook Twitter Pinterest Email Yum Share AERO Milk Chocolate Minis Pouch (800 g) 800 g Now you can enjoy bite-sized minis of classic, bubbly AERO real milk chocolate – anywhere and anytime. This value-sized pouch full of NESTLÉ AERO Milk Chocolate Minis Pouch (800 g) is a convenient way to share the deliciously and delightfully smooth milk chocolate filled with airy bubbles with friends and family. Proudly prepared in Canada in a peanut-free facility, each piece is made with natural flavours and no artificial colours. Plus, 100% of our landfill waste at our chocolate factory is diverted to an electrical co-generation plant, and we only use 100% sustainably sourced, RAINFOREST ALLIANCE CERTIFIED cocoa to ensure the best quality and strengthen the communities of our farmers. FEEL THE BUBBLES MELT.",
    "features_benefits": "A value-sized pouch with melt-in-your-mouth bites of real milk chocolate filled with tiny bubbles NESTLÉ AERO Milk Chocolate Minis Pouch (800 g) are proudly prepared in Canada and made with only natural flavours and no artificial colours Resealable pouch makes these bubble-bites easy to share with family and friends We purchase 100% RAINFOREST ALLIANCE CERTIFIED cocoa, as part of the NESTLÉ COCOA PLAN. We work with the RAINFOREST ALLIANCE and farmers to improve the quality of their products and strengthen their communities 100% of our landfill waste at our chocolate factory in Toronto is diverted to an electrical co-generation plant",
    "nutrition": "Per 11 pieces (39 g) Amount % DV Calories 200 Carbohydrate 25 g Fibre 1 g 4 % Sugars 23 g 23 % Fat 11 g 15 % Cholesterol 10 mg Saturated Fat 6 g 31 % Trans Fat 0.1 g Protein 2 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 175 mg 4 %",
    "ingredients": "*rainforest alliance certified™."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-milk-chocolate-minis",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Milk Chocolate Minis",
    "weight": "135 g",
    "description": "Aero AERO Milk Chocolate Minis Share This Facebook Twitter Pinterest Email Yum Share AERO Milk Chocolate Minis 135 g Unwrap at game time to take a moment to FEEL THE BUBBLES MELT. As part of the official line up of the NHL, this pouch full of NESTLÉ AERO Milk Chocolate Minis Cello Pouch (135 g) is a convenient way to share the delight of smooth milk chocolate filled with airy bubbles. Proudly prepared in Canada, each piece is carefully made with natural flavours, and no artificial colours. Plus, we use only sustainably sourced cocoa, to ensure the best quality, and strengthen the communities of our farmers. It's simply the best way to FEEL THE BUBBLES MELT with family and friends.",
    "features_benefits": "Melt-in-your-mouth bites of real milk chocolate filled with tiny bubbles NESTLÉ AERO Milk Chocolate Minis (135 g) are made with only natural flavours and no artificial colours Individual bubble-bites makes it easy to share with family and friends – unwrap at game time! Proudly prepared in Canada – part of the official line up of the NHL We purchase RAINFOREST ALLIANCE CERTIFIED cocoa, as part of the NESTLÉ COCOA PLAN. We work with the RAINFOREST ALLIANCE and farmers to improve the quality of products and strengthen communities Proudly Prepared in Canada",
    "nutrition": "Per 11 pieces  (39 g) Amount % DV Calories 210 0 % Carbohydrate 24 g Fibre 1 g 4 % Sugars 23 g 23 % Fat 11 g 15 % Cholesterol 10 mg 0 % Saturated Fat 7 g 36 % Trans Fat 0.1 g Protein 2 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 0.1 g 1 %",
    "ingredients": "Wheat."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-peppermint-milk-chocolate-minis",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Peppermint Milk Chocolate Minis",
    "weight": "135 g",
    "description": "Aero AERO Peppermint Milk Chocolate Minis Share This Facebook Twitter Pinterest Email Yum Share AERO Peppermint Milk Chocolate Minis 135 g Taste the refreshing decadence of AERO Peppermint Milk Chocolate Minis. Made with sustainable cocoa, each bite-sized delicious treat is made with creamy, real milk chocolate covering a real peppermint centre. As you FEEL THE BUBBLES MELT™ with each mini piece, you’ll get a burst of pure mint-chocolate bliss.",
    "features_benefits": "Mini pieces of real milk chocolate, covering a real peppermint centre. Made with Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ COCOA PLAN. We work with UTZ and farmers to improve the quality of their products and strengthen their communities. Re-sealable pouch for freshness Made with natural real peppermint flavour Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service Proudly Prepared in Canada",
    "nutrition": "Per 11 pieces  (39 g) Amount % DV Calories 210 0 % Carbohydrate 24 g 8 % Fibre 0 g 0 % Sugars 23 g 0 % Fat 12 g 18 % Cholesterol 10 mg 0 % Saturated Fat 7 g 36 % Trans Fat 0.1 g 0 % Protein 2 g 0 % Sodium 30 mg 1 % Amount % DV Calcium 6 % Iron 0 % Vitamin A 2 % Vitamin C 0 %",
    "ingredients": "Wheat."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-dark-milk-chocolate-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Dark & Milk Chocolate Bar",
    "weight": "42 g",
    "description": "Aero AERO Dark & Milk Chocolate Bar Share This Facebook Twitter Pinterest Email Yum Share AERO Dark & Milk Chocolate Bar 42 g Experience the NESTLÉ AERO ® Dark & Milk Chocolate Bar (42 g), a dark chocolate bar filled with irresistible milk chocolate bubbles that melt in your mouth. The perfect pairing of dark and milk chocolate and the incredible lightness of the bubbles will delight your senses, making it a must-share experience with friends and family. Made with only natural flavours and no artificial colours, we purchase Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ ® COCOA PLAN ® . We work with UTZ and farmers to improve the quality of their products and strengthen their communities. Snap off a piece and take a moment to FEEL THE BUBBLES MELT ® .",
    "features_benefits": "Dark chocolate bar filled with milk chocolate bubbles Made with real milk and dark chocolate, natural flavours, no artificial colours, and made in Canada Breakable bar makes it easy to snap off a piece and share We purchase Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ ® COCOA PLAN ® FEEL THE BUBBLES MELT ® Proudly Prepared in Canada",
    "nutrition": "Per 1 bar (42g) Amount % DV Calories 230 Carbohydrate 24 g Fibre 3 g 11 % Sugars 19 g 19 % Fat 14 g 19 % Cholesterol 5 mg Saturated Fat 8 g 40 % Trans Fat 0 g Protein 3 g Sodium 20 mg 1 % Amount % DV Calcium 50 mg 4 % Iron 2 mg 11 % Potassium 225 mg 5 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-milk-chocolate-bubble-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "NESTLÉ® AERO® Milk Chocolate Bar 42g",
    "weight": "NESTLÉ® AERO® Milk Chocolate Bar 42g",
    "description": "Aero NESTLÉ® AERO® Milk Chocolate Bar 42g Share This Facebook Twitter Pinterest Email Yum Share NESTLÉ® AERO® Milk Chocolate Bar 42g 42 g Feel the bubbles melt with AERO Milk Chocolate Bar. The definition of bubbly bliss: smooth, creamy milk chocolate with the incredible lightness of bubbles gives you an effortless melt in every bite!",
    "features_benefits": "Real milk chocolate Made with sustainably sourced cocoa from the Nestlé Cocoa Plan Made with natural flavours and no artificial colours Great for baking and s’mores Easy to break off and share Proudly Prepared in Canada",
    "nutrition": "Per 1 bar  (42 g) Amount % DV Calories 220 0 % Carbohydrate 27 g Fibre 1 g 4 % Sugars 25 g 25 % Fat 12 g 16 % Cholesterol 10 mg 0 % Saturated Fat 7 g 36 % Trans Fat 0.1 g 0 % Protein 3 g 0 % Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 g 6 % Potassium 175 mg 4 % Vitamin A",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-white-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO White Bar",
    "weight": "42 g",
    "description": "Aero AERO White Bar Share This Facebook Twitter Pinterest Email Yum Share AERO White Bar 42 g Melt away with creamy milk chocolate over delicious white chocolate full of tiny bubbles that dissolve on your tongue in each piece of AERO® White & Milk Chocolate Bar (42 g). Proudly manufactured in Canada, each moment of savoury satisfaction as bubbles melt in your mouth is perfect for sharing with family and friends. Made with only natural flavours and no artificial colours, we use only sustainably sourced cocoa, to ensure the best quality, and strengthen the communities of our farmers. Just snap off a piece and take a moment to FEEL THE BUBBLES MELT™.",
    "features_benefits": "Real milk chocolate filled with bubbly white chocolate that delightfully melts in your mouth Made with only natural flavours and no artificial colours Breakable bar makes it easy to snap off a piece to share with family and friends We purchase Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ® COCOA PLAN®. We work with UTZ and farmers to improve the quality of their products and strengthen their communities Proudly Prepared in Canada",
    "nutrition": "Per 1 Bar (42g) Amount % DV Calories 230 Carbohydrate 26 g Sugars 25 g Fat 13 g 17 % Cholesterol 10 mg Saturated Fat 7 g Trans Fat 0.1 g Protein 2 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 0.5 mg Potassium 125 mg 3 %",
    "ingredients": "*Rainforest Alliance Certified"
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-peppermint-milk-chocolate-bubble-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Mint - Peppermint Milk Chocolate Bubble Bar",
    "weight": "41 g",
    "description": "Aero AERO Mint - Peppermint Milk Chocolate Bubble Bar Share This Facebook Twitter Pinterest Email Yum Share AERO Mint - Peppermint Milk Chocolate Bubble Bar 41 g Feel the bubbles melt with AERO Peppermint Bar . The creamy milk chocolatey shell with real peppermint centre gives you a delicious and refreshing, melt-in-your-mouth experience.",
    "features_benefits": "Real peppermint flavour Made with sustainably sourced cocoa from the Nestlé Cocoa Plan Great for recipes Super easy to break off and share Made with natural flavours and no artificial colours",
    "nutrition": "Per 1 bar (41 g) Amount % DV Calories 220 0 % Carbohydrate 26 g 9 % Fibre 0 g 0 % Sugars 25 g 0 % Fat 12 g 18 % Cholesterol 5 mg 2 % Saturated Fat 7 g 36 % Trans Fat 0.1 g 0 % Protein 2 g 0 % Sodium 40 mg 2 % Amount % DV Calcium 6 % Iron 2 % Vitamin A 2 % Vitamin C 0 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-peppermint-share-size-milk-chocolate-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "63 g",
    "weight": "63 g",
    "description": "Aero AERO Peppermint Share-Size Milk Chocolate Bar Share This Facebook Twitter Pinterest Email Yum Share AERO Peppermint Share-Size Milk Chocolate Bar 63 g Melt away with creamy milk chocolate and refreshing mint-flavoured bubbles that dissolve on your tongue in each piece of NESTLÉ AERO Peppermint Share-Size Milk Chocolate Bar (63 g). Proudly crafted in Canada, each moment of savoury satisfaction is perfect for sharing with family and friends. Made with only natural flavours and no artificial colours, we use RAINFOREST ALLIANCE CERTIFIED cocoa, as part of the NESTLÉ COCOA PLAN. This extra-large AERO bar is divided into 3 individual pieces, making it perfect for sharing. This share-sized AERO is the ultimate way to FEEL THE BUBBLES MELT.",
    "features_benefits": "NESTLÉ AERO Peppermint Share-Size Milk Chocolate Bar (63 g) is real milk chocolate with a bubbly mint-flavoured centre that melts in your mouth Share-sized bar divided into 3 individual pieces to share with family and friends We purchase RAINFOREST ALLIANCE CERTIFIED cocoa, as part of the NESTLÉ COCOA PLAN. We work with the RAINFOREST ALLIANCE and farmers to improve the quality of their products and strengthen their communities Made with natural flavours and no artificial colours 100% of our waste at our Toronto chocolate factory is diverted to an electrical cogeneration plan Proudly Prepared in Canada",
    "nutrition": "Per 3 pieces (63 g) Amount % DV Calories 340 Carbohydrate 39 g Fibre 1 g 4 % Sugars 37 g 37 % Fat 19 g 25 % Cholesterol 15 mg Saturated Fat 11 g Trans Fat 0.1 g Protein 4 g Sodium 55 mg 2 % Amount % DV Calcium 125 mg 10 % Iron 0.75 mg 4 % Potassium 200 mg 4 %",
    "ingredients": "*Rainforest Alliance Certified™."
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-milk-chocolate-3-piece-share-pack",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "63 g",
    "weight": "63 g",
    "description": "Aero AERO Milk Chocolate 3-Piece Share Pack Share This Facebook Twitter Pinterest Email Yum Share AERO Milk Chocolate 3-Piece Share Pack 63 g Melt away with creamy milk chocolate filled with irresistible, tiny bubbles that dissolve on your tongue in each piece of AERO® Milk Chocolate Share-Size 3-Piece Bar (63 g). Proudly manufactured in Canada, each moment of savoury satisfaction as bubbles melt in your mouth is perfect for sharing with family and friends. Made with only natural flavours and no artificial colours, we use only sustainably sourced cocoa, to ensure the best quality, and strengthen the communities of our farmers. With 3 individual pieces, this bar makes it easy to share with friends and family. Take a moment to FEEL THE BUBBLES MELT™.",
    "features_benefits": "We purchase Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ® COCOA PLAN®. We work with UTZ and farmers to improve the quality of their products and strengthen their communities Proudly Prepared in Canada",
    "nutrition": "Per  3 pieces  (63 g) Amount % DV Calories 330 0 % Carbohydrate 40 g Fibre 1 g 4 % Sugars 37 g 37 % Fat 18 g 24 % Cholesterol 15 mg Saturated Fat 10 g Trans Fat 0.1 g Protein 4 g Sodium 55 mg 2 % Amount % DV Calcium 100 mg 8 % Iron 1.5 mg 8 % Potassium 250 mg 5 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-milk-chocolate-big-bubble-bar-97g",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Milk Chocolate Big Bubble Bar (97 g)",
    "weight": "AERO Milk Chocolate Big Bubble Bar (97 g)",
    "description": "Aero AERO Milk Chocolate Big Bubble Bar (97 g) Share This Facebook Twitter Pinterest Email Yum Share AERO Milk Chocolate Big Bubble Bar (97 g) 97 g Feel the bubbles melt with AERO Milk Chocolate Bar (97 g) Bubbly milk chocolate, a melt-in-your-mouth experience you can share with friends or save for later.",
    "features_benefits": "Bubbly milk chocolate tablet Perfect for sharing with family and friends Made with sustainably sourced cocoa from the Nestlé Cocoa Plan Made with natural flavours Great for baking and s’mores Proudly Prepared in Canada",
    "nutrition": "Per 9 segments  (41 g) Amount % DV Calories 220 0 % Carbohydrate 26 g 9 % Fibre 1 g 4 % Sugars 24 g 0 % Fat 12 g 18 % Cholesterol 10 mg 0 % Saturated Fat 7 g 35 % Trans Fat 0.1 g 0 % Protein 2 g 0 % Sodium 35 mg 1 % Amount % DV Calcium 6 % Iron 0 % Vitamin A 2 % Vitamin C 0 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-peppermint-chocolate-bar",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Peppermint Chocolate Bar",
    "weight": "95 g",
    "description": "Aero AERO Peppermint Chocolate Bar Share This Facebook Twitter Pinterest Email Yum Share AERO Peppermint Chocolate Bar 95 g Savour the refreshing and delicious peppermint bubbles, all covered in a rich, milk chocolate shell. NESTLÉ AERO ® Peppermint Chocolate Bar (95 g) is made with natural flavours and no artificial colours. The perfect combination of real milk chocolate and peppermint that's easy to break off and enjoy. Perfect for taking a moment to FEEL THE BUBBLES MELT ® .",
    "features_benefits": "More of what you love! Experience the irresistible melt of a bubbly peppermint flavoured centre covered in a real milk chocolate shell NESTLÉ ® AERO ® Peppermint Chocolate Bar (95 g) is made with natural flavours, & no artificial colours Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ ® COCOA PLAN ® Proudly Prepared in Canada",
    "nutrition": "Per 9 segments (40 g) Amount % DV Calories 210 Carbohydrate 25 g Fibre 0 g 0 % Sugars 24 g 24 % Fat 12 g 16 % Cholesterol 10 mg Saturated Fat 7 g 36 % Trans Fat 0.1 g Protein 2 g Sodium 35 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 0.5 mg 3 % Potassium 125 mg 3 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-snack-size-milk-chocolate-peanut-free",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Snack Size, Milk Chocolate, Peanut-free",
    "weight": "8 x 7.3 g",
    "description": "Aero AERO Snack Size, Milk Chocolate, Peanut-free Share This Facebook Twitter Pinterest Email Yum Share AERO Snack Size, Milk Chocolate, Peanut-free 8 x 7.3 g",
    "features_benefits": "Feel The Bubbles Melt: Indulge in the smooth, creamy taste of milk chocolate, peppermint-flavoured centre, and melt-in-your-mouth bubbles with NESTLÉ AERO Peppermint snack size chocolate bars Easy To Share: Each snack size NESTLÉ AERO bar is individually wrapped making them ideal for everyday snacking or sharing with family and friends",
    "nutrition": "Pep 8 bars (58 g) Amount % DV Calories 300 Carbohydrate 37 g Fibre 1 g 4 % Sugars 35 g 35 % Cholesterol 10 mg Saturated Fat 10 g Total Fat 16 g 21 % Trans Fat 0.1 g Protein 4 g Sodium 50 mg 2 % Amount % DV Calcium 100 mg 8 % Iron 1.5 mg 8 % Potassium 250 mg 7 %",
    "ingredients": "Wheat. *Rainforest Alliance Certified"
  },
  {
    "url": "https://www.madewithnestle.ca/prepared-canada/assorted-minis-carton-25-pack",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "Prepared in Canada",
    "weight": "237 g",
    "description": "Prepared in Canada Assorted Minis Carton 25 pack Share This Facebook Twitter Pinterest Email Yum Share Assorted Minis Carton 25 pack 237 g",
    "features_benefits": "The Perfect Treat For Halloween: This assorted pack includes 25 of your favourite NESTLÉ mini bars and candies, all perfectly portioned and individually wrapped, making them ideal for Halloween All Your Favourites In One Bag: Have your favourite, or all your favourites, in this assorted bag of 25 minis, including NESTLÉ KITKAT, AERO, SMARTIES, and COFFEE CRISP Made In A Peanut-Free Facility: NESTLÉ KITKAT, AERO, SMARTIES, and COFFEE CRISP minis are prepared in a Canadian peanut-free facility where we employ rigorous quality control processes to ensure its peanut-free status; There may be other products under the KITKAT, AERO, SMARTIES, or COFFEE CRISP brands that contain peanuts, so be sure to read the label every time Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, we purchase Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service Protecting Our Planet: 100% of landfill waste at our chocolate factory in Toronto is diverted to an electrical co-generation plant Proudly Prepared in Canada",
    "nutrition": "Smarties Per 4 boxes (40 g) Per 4 boxes (40 g) Amount % DV Calories 180 Carbohydrate 31 g Dietary Fiber 0 g 0 % Sugars 29 g 29 % Fat 6 g 8 % Cholesterol 5 mg Saturated 3.5 g Trans Fat 0 g Protein 1 g Sodium 20 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 0.5 mg 3 % Potassium 100 mg 3 % Coffee Crisps Per 4 bars (44 g) Per 4 bars (44 g) Amount % DV Calories 220 Carbohydrate 29 g Dietary Fiber 1 g 4 % Sugars 19 g 19 % Fat 11 g 15 % Cholesterol 5 mg Saturated 6 g Trans Fat 0.1 g Protein 2 g Sodium 45 mg 2 % Amount % DV Calcium 40 mg 3 % Iron 0.75 mg 4 % Potassium 125 mg 4 % KitKat Per 3 bars (35 g) Per 3 bars (35 g) Amount % DV Calories 180 Carbohydrate 23 g Dietary Fiber 1 g 4 % Sugars 18 g 18 % Fat 9 g 12 % Cholesterol 5 mg Saturated 5 g Trans Fat 0.1 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 1 mg 6 % Potassium 125 mg 4 % Aero Per 6 bars (44 g) Per 6 bars (44 g) Amount % DV Calories 230 Carbohydrate 28 g Dietary Fiber 1 g 4 % Sugars 26 g 26 % Fat 12 g 16 % Cholesterol 10 mg Saturated 7 g Trans Fat 0.1 g Protein 3 g Sodium 40 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 200 mg 6 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/prepared-canada/assorted-minis-carton-50-pack",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "Prepared in Canada",
    "weight": "485 g",
    "description": "Prepared in Canada Assorted Minis Carton 50 pack Share This Facebook Twitter Pinterest Email Yum Share Assorted Minis Carton 50 pack 485 g",
    "features_benefits": "The Perfect Treat For Halloween: This assorted pack includes 50 of your favourite NESTLÉ mini bars and candies, all perfectly portioned and individually wrapped, making them ideal for Halloween All Your Favourites In One Bag: Have your favourite, or all your favourites, in this assorted bag of 50 minis, including NESTLÉ KITKAT, AERO, SMARTIES, and COFFEE CRISP Made In A Peanut-Free Facility: NESTLÉ KITKAT, AERO, SMARTIES, and COFFEE CRISP minis are prepared in a Canadian peanut-free facility where we employ rigorous quality control processes to ensure its peanut-free status; There may be KITKAT, AERO, SMARTIES, or COFFEE CRISP products under the KITKAT, AERO, SMARTIES, or COFFEE CRISP brands that contain peanuts, make sure to read the label every time Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, we purchase Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service Protecting Our Planet: 100% of landfill waste at our chocolate factory in Toronto is diverted to an electrical co-generation plant Proudly Prepared in Canada",
    "nutrition": "KitKat Per 3 bars (35 g) Per 3 bars (35 g) Amount % DV Calories 180 Carbohydrate 23 g Dietary Fiber 1 g 4 % Sugars 18 g 18 % Fat 9 g 12 % Cholesterol 5 mg Saturated 5 g Trans Fat 0.1 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 1 mg 6 % Potassium 125 mg 4 % Smarties Per 4 boxes (40 g) Per 4 boxes (40 g) Amount % DV Calories 180 Carbohydrate 31 g Dietary Fiber 0 g 0 % Sugars 29 g 29 % Fat 6 g 8 % Cholesterol 5 mg Saturated 3.5 g Trans Fat 0 g Protein 1 g Sodium 20 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 0.5 mg 3 % Potassium 100 mg 3 % Aero Per 6 bars (44 g) Per 6 bars (44 g) Amount % DV Calories 230 Carbohydrate 28 g Dietary Fiber 1 g 4 % Sugars 26 g 26 % Fat 12 g 16 % Cholesterol 10 mg Saturated 7 g Trans Fat 0.1 g Protein 3 g Sodium 40 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 200 mg 6 % Coffee Crisps Per 4 bars (44 g) Per 4 bars (44 g) Amount % DV Calories 220 Carbohydrate 29 g Dietary Fiber 1 g 4 % Sugars 19 g 19 % Fat 11 g 15 % Cholesterol 5 mg Saturated 6 g Trans Fat 0.1 g Protein 2 g Sodium 45 mg 2 % Amount % DV Calcium 40 mg 3 % Iron 0.75 mg 4 % Potassium 125 mg 4 %",
    "ingredients": "Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour). *Rainforest Alliance Certified SMARTIES Ingredients: Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour), Sugars (sugar, maltodextrin), Wheat flour, Modified corn starch, Carnauba wax, Gum arabic, Beet red, Spirulina, Turmeric, Carotene, Anthocyanin, Sodium copper chlorophyllin. *Rainforest Alliance Certified KITKAT Ingredients: Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour), Sugar, Wheat flour, Modified palm oil, Cocoa*, Palm oil, Baking soda, Soy lecithin, Yeast, Protease, Xylanase. * Rainforest Alliance Certified COFFEE CRISP Ingredients: Sugars (sugar, glucose solids, lactose), Wheat flour, Palm and vegetable oils, Modified milk ingredients, Unsweetened chocolate*, Cocoa butter*, Soy lecithin, Coffee, Baking soda, Cocoa*, Polyglycerol polyricinoleate, Yeast, Protease, Xylanase, Natural flavour. *Rainforest Alliance Certified"
  },
  {
    "url": "https://www.madewithnestle.ca/prepared-canada/assorted-minis-carton-100-pack",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "Prepared in Canada",
    "weight": "977g",
    "description": "Prepared in Canada Assorted Minis Carton 100 pack Share This Facebook Twitter Pinterest Email Yum Share Assorted Minis Carton 100 pack 977g",
    "features_benefits": "Miniature, individually-wrapped versions of your favourite NESTLÉ® treats: SMARTIES®, KITKAT®, COFFEE CRISP® and AERO® Made with natural flavours, and no artificial colours in a peanut-free facility Individually-wrapped mini-bars, perfect for handing out to trick-or-treaters or sharing at parties with friends and family We purchase Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ® COCOA PLAN®. We work with UTZ and farmers to improve the quality of their products and strengthen their communities Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service Proudly Prepared in Canada",
    "nutrition": "KitKat Per 3 bars (35 g) Per 3 bars (35 g) Amount % DV Calories 180 Carbohydrate 23 g Dietary Fiber 1 g 4 % Sugars 18 g 18 % Fat 9 g 12 % Cholesterol 5 mg Saturated 5 g Trans Fat 0.1 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 1 mg 6 % Potassium 125 mg 4 % Aero Per 6 bars (44 g) Per 6 bars (44 g) Amount % DV Calories 230 Carbohydrate 28 g Dietary Fiber 1 g 4 % Sugars 26 g 26 % Fat 12 g 16 % Cholesterol 10 mg Saturated 7 g Trans Fat 0.1 g Protein 3 g Sodium 40 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 200 mg 6 % Smarties Per 4 boxes (40 g) Per 4 boxes (40 g) Amount % DV Calories 180 Carbohydrate 31 g Dietary Fiber 0 g 0 % Sugars 29 g 29 % Fat 6 g 8 % Cholesterol 5 mg Saturated 3.5 g Trans Fat 0 g Protein 1 g Sodium 20 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 0.5 mg 3 % Potassium 100 mg 3 % Coffee Crisps Per 4 bars (44 g) Per 4 bars (44 g) Amount % DV Calories 220 Carbohydrate 29 g Dietary Fiber 1 g 4 % Sugars 19 g 19 % Fat 11 g 15 % Cholesterol 5 mg Saturated 6 g Trans Fat 0.1 g Protein 2 g Sodium 45 mg 2 % Amount % DV Calcium 40 mg 3 % Iron 0.75 mg 4 % Potassium 125 mg 4 %",
    "ingredients": "Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour). *Rainforest Alliance Certified. KITKAT Ingredients: Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour), Sugar, Wheat flour, Modified palm oil, Cocoa*, Palm oil, Baking soda, Soy lecithin, Yeast, Protease, Xylanase. * Rainforest Alliance Certified SMARTIES Ingredients: Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour), Sugars (sugar, maltodextrin), Wheat flour, Modified corn starch, Carnauba wax, Gum arabic, Beet red, Spirulina, Turmeric, Carotene, Anthocyanin, Sodium copper chlorophyllin. *Rainforest Alliance Certified COFFEE CRISP Ingredients: Sugars (sugar, glucose solids, lactose), Wheat flour, Palm and vegetable oils, Modified milk ingredients, Unsweetened chocolate*, Cocoa butter*, Soy lecithin, Coffee, Baking soda, Cocoa*, Polyglycerol polyricinoleate, Yeast, Protease, Xylanase, Natural flavour. *Rainforest Alliance Certified"
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-milk-chocolate-4-pack",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Milk Chocolate Bar 4-pack",
    "weight": "4 x 42 g",
    "description": "Aero AERO Milk Chocolate Bar 4-pack Share This Facebook Twitter Pinterest Email Yum Share AERO Milk Chocolate Bar 4-pack 4 x 42 g Melt away with creamy milk chocolate filled with irresistible, tiny bubbles that dissolve on your tongue, in this sharable 4-pack of AERO Milk Chocolate Bars. Proudly manufactured in Canada, take a moment to share the sensation of bubbles melting on your tongue with family and friends. Made with only natural flavours and no artificial colours, we use only sustainably sourced cocoa, to ensure the best quality, and strengthen the communities of our farmers. Snap off a piece and take a moment to Feel the Bubbles Melt.",
    "features_benefits": "4 bars of real milk chocolate filled with tiny bubbles that melt deliciously in your mouth Made with only natural flavours and no artificial colours Each breakable bar makes it easy to snap off a piece to share with family and friends We purchase Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ COCOA PLAN. We work with UTZ and farmers to improve the quality of their products and strengthen their communities Proudly Prepared in Canada",
    "nutrition": "Per 1 bar  (42 g) Amount % DV Calories 220 Carbohydrate 26 g 9 % Fibre 1 g 4 % Sugars 25 g Fat 12 g 18 % Cholesterol 10 mg Saturated Fat 7 g 36 % Trans Fat 0.1 g Protein 3 g Sodium 35 mg 1 % Amount % DV Calcium 6 % Iron 0 % Vitamin A 4 % Vitamin C 0 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/halloween/nestle-assorted-minis-carton-pack",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "NESTLÉ Assorted Minis Carton pack",
    "weight": "1.3 kg",
    "description": "Halloween NESTLÉ Assorted Minis Carton pack Share This Facebook Twitter Pinterest Email Yum Share NESTLÉ Assorted Minis Carton pack 1.3 kg Enjoy trick-or-treating, snack time, party time, at Halloween with all your favourite treats in NESTLÉ Minis Assorted Chocolates (Pack of 130). This box is full of miniature versions of classic NESTLÉ treats like KITKAT, SMARTIES, AERO, and COFFEE CRISP. Plus, these treats are made with natural flavours, sustainably sourced cocoa, and natural colours in a peanut-free facility right here in Toronto, Canada. It's the best way to Stay Spooky with NESTLÉ, and share your love of Halloween with family and friends.",
    "features_benefits": "Miniature, individually-wrapped versions of your favourite NESTLÉ treats: KITKAT, SMARTIES, AERO, and COFFEE CRISP. Individually-wrapped mini bars, perfect for trick-or-treating at Halloween or sharing with friends and family. We purchase Rainforest Alliance Certified cocoa, as part of the NESTLÉ COCOA PLAN. We work with the Rainforest Alliance and farmers to help improve the quality of their products and strengthen their communities. Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service Made in a peanut-free facility Proudly Prepared in Canada",
    "nutrition": "Smarties Amount % DV Calories 180 Carbohydrate 31 g Dietary Fiber 0 g 0 % Sugars 29 g 29 % Fat 6 g 8 % Cholesterol 5 mg Saturated 3.5 g Trans Fat 0 g Protein 1 g Sodium 20 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 0.5 mg 3 % Potassium 100 mg 3 % Coffee crisp Per 4 bars (44 g) Amount % DV Calories 220 Carbohydrate 29 g Dietary Fiber 1 g 4 % Sugars 19 g 19 % Fat 11 g 15 % Cholesterol 5 mg Saturated 6 g Trans Fat 0.1 g Protein 2 g Sodium 45 mg 2 % Amount % DV Calcium 40 mg 3 % Iron 0.75 mg 4 % Potassium 125 mg 4 % KitKat Per 3 bars (35 g) Amount % DV Calories 180 Carbohydrate 23 g Dietary Fiber 1 g 4 % Sugars 18 g 18 % Fat 9 g 12 % Cholesterol 5 mg Saturated 5 g Trans Fat 0.1 g Protein 2 g Sodium 30 mg 1 % Amount % DV Calcium 40 mg 3 % Iron 1 mg 6 % Potassium 125 mg 4 % Aero per 6 bars (44 g) Amount % DV Calories 230 Carbohydrate 28 g Dietary Fiber 1 g 4 % Sugars 26 g 26 % Fat 12 g 16 % Cholesterol 10 mg Saturated 7 g Trans Fat 0.1 g Protein 3 g Sodium 40 mg 2 % Amount % DV Calcium 75 mg 6 % Iron 1 mg 6 % Potassium 200 mg 6 %",
    "ingredients": ""
  },
  {
    "url": "https://www.madewithnestle.ca/aero/aero-peppermint-multipack",
    "brand": "Aero",
    "category": "Chocolate & Treats",
    "name": "AERO Peppermint Bar 4-pack",
    "weight": "4 x 41 g",
    "description": "Aero AERO Peppermint Bar 4-pack Share This Facebook Twitter Pinterest Email Yum Share AERO Peppermint Bar 4-pack 4 x 41 g Feel the bubbles melt with AERO Peppermint Bar (4 x 41 g). A refreshing taste of real peppermint and a melt-in-your-mouth experience.",
    "features_benefits": "Real peppermint flavour Multipack of four AERO bars Made with sustainably sourced cocoa from the Nestlé Cocoa Plan Made with natural flavours Great for baking and s’mores Proudly Prepared in Canada",
    "nutrition": "Per 1 bar  (41 g) Amount % DV Calories 220 0 % Carbohydrate 26 g 9 % Fibre 0 g 0 % Sugars 25 g 0 % Fat 12 g 18 % Cholesterol 5 mg 2 % Saturated Fat 7 g 36 % Trans Fat 0.1 g 0 % Protein 2 g 0 % Sodium 40 mg 2 % Amount % DV Calcium 6 % Iron 2 % Vitamin A 2 % Vitamin C 0 %",
    "ingredients": ""
  }
]